{
    "https://career.habr.com/vacancies/1000089071": [
        "Привет!Поговорим про Senior Full-Stack позицию в IT-first проекте на стыке HR и Fintech.Что интересного:\nРелокация в Барселону в течение полугода силами компанииАнглоязычная команда и разработкаВысокая ответственность и участие в развитии продукта (маленькая команда, плоская структура)В Барселоне есть офис, но часть времени работать удаленно и график гибкийБолее 90% задач это разработка новых фич (выход на новые страны Европы)\nКритично важный опыт:Full-Stack (и backend и frontend) от 4х летReact или Angular на фронте (несколько интерфейсов системы, поэтому есть выбор фреймворка)Node..JSАнглийский язык свободный для ежедневной устной и письменной коммуникации с командой и полного взаимопонимания.Вариант \"подтянуть за пару месяцев\" никак не пройдет на уровне интервью. Шекспира мы тоже не ищем.\nОчень желанный для нас опыт с чем-то из:\nTypeScriptReact NativeMySQLAWS, Docker на уровне легкого DevOps и CI/CDИнтеграции, API, fintech, payment processing\nКивнул всего 5 раз? Срочно говорим! Мой телеграм в разделе \"О Компании\", меня зовут Аня,  давай договоримся о времени интервью!Что делать:\nBUILD INTEGRATIONS WITH HR SOFTWARE. Our strength is to go live with all the possible HR software to ensure our client's quickest onboarding.DEVELOP OUR DASHBOARD. Give better tools for HR departments to retain their talents and take the constant temperature of the financial well-being of their employees.You will be building and scaling a product in the early stages now, not changing the button's color.\nКомпания Payflow.es: B2B.\nHR payroll при подключении которого компанией, её сотрудники получают возможность: быстрого доступа к своей зарплате (не обязательно ждать 1го числа, если сегодня 20е) и обучение финансам.\nУспешно запущены в Испании, предстоит скорый запуск в других странах Европы и выпуск дебитовых карт.Недавний выпускник Y Combinator, проинвестированы, быстро растут, запущены, проекту 1.5 года – здесь свежий качественный код и современный стек.Небольшая и сильная команда: 18 сотрудников, 7 в IT, 10 национальностей.\nБонусыДля тебя:\nУдаленка на первые 3-6 месяцев пока оформляем документы и готовим релокацию (лучше в Барселону, можно в Мадрид)Full-Time contract (официальное трудоустройство по ТК)40 000 - 50 000 euro gross годового доходаНалоговая система гибкая, сумма налога снижается при наличии детей, семьи, так что даю самую приблизительную цифру: 35 000 euro в год / 3000 euro в месяц после налогов. Сюда включена медицина, и это крайне хороший уровень зарплаты и жизни по Испании.Новое железо: Mac или PCГибкий график без обязательных часов, возможность удаленной работы бОльшую часть неделиМультикультурная команда, заряженная на продукт, высокая ценность команды и \"мы делаем это вместе\". Предприниматели, настроенные на успех.Дополнительные инструкцииЧто будет: наше знакомство (1 час) ----> знакомство с тимлидом и разработчиком из команды (1 час) ----> дополнительная сессия с разработчиками (30 минут) ----> coffee-talk with CEO (15 минут) ----> оффер (5 минут) ----> долгая и счастливая работа вместе. Поговорим? Откликайся или напиши мне! Мои контакты на странице \"О компании\".  Аня. "
    ],
    "https://career.habr.com/vacancies/1000089070": [
        "About the company:Leader in marketing analytics and statistics automation with hundreds of thousands of customers worldwide (Warner Bros., BBC, Dyson and others)Requirements:Strong OOP skills, strictly-typed PHPExtensive experience in SQL, NoSQLJavascript and / or typescriptGit, Docker, Unit-testExperience with high load applicationsTeam management experienceResponsibilities:Teamwork, API development, PHP programming. Applying new technologies to create great services for our clientsThe company office in Helsinki, Finland.Company provide full relocation package for family"
    ],
    "https://career.habr.com/vacancies/1000089069": [
        "Our operations are based on the intersection of three global macro trends – IoE, 5G and AI. At the same time, globalization and digitalization in our core business areas, the automotive industry, the industry 4.0, and secure systems and communications, require an understanding of broader entities and more precise technology-specific expertise. There is a growing need for experts in embedded systems data, applications, and user experience.Now we are looking for Experienced Embedded Engineer to our fast growing team. You will start your journey either in a selected customer project or in company internal product development team.We are ambitious, engaged and excited about transforming industries with software innovations. We’re looking for software experts who are inspired to working on challenging technology and like to solve hard problems.REQUIRED QUALIFICATIONSCompany hires embedded system developers for multiple positions and projects, and that is why we have a possibility to be flexible with you and allocate you to the project that matches the best with your background, skills and areas of interest.The common requirements for most of our embedded system positions are strong skills in embedded C/C++ preferably with embedded Linux. You could have worked in low level with microcontrollers and RTOS or you might have focused on drivers, kernel and platform level development. Or maybe your expertise area is more in application side development, which is okay too!Experience in telecom sector and some of the following technologies is considered as an advantage: L1/L2, hypervisors, virtualization, ARM HW bring-up & debugging, RISC-V, Python, Yocto, Rust and/or Android.In order to find the right position for you, please introduce yourself to Unikie’s recruitment team and describe your experience and areas of interest. The potential candidates will be invited to an interview for further discussion.WE OFFER YOUYou get to work within an experienced and ambitious communityYou get to work in a global environment, that develops modern, secure solutions for pioneers in their fieldWith us you get to work challenging and changing projects and you get the chance to develop your skills in a superb group of peopleFair and transparent wage model which highly correlates with your skills and offers you a fair share from the customer invoicingYou get to work in a flexible low-hierarchy organization that looks after its ownIn addition to our customer deliveries, we focus on our own R&D, where you can bring your own expertise to, if you want to.\nOffice: Tampere (optional), Finland\nRelocation package"
    ],
    "https://career.habr.com/vacancies/1000089068": [
        "About us: Market analysis platform used by the world's leading companies and financial institutions. Leverage artificial intelligence technology to provide insights from public and private content, including company reports, news, industry journals, and stock market research.\nWe are seeking a passionate Cloud Native Engineer to help develop the next big thing in data analysis and search solutions.\nYou will join our Cloud infrastructure team supporting our developers by taking care of the platform. As a Cloud Native Engineer, you’ll be developing the platform and the tools to help run it, using and promoting best development practices along best cloud architecture principles to create and improve a scalable, observable, fault-tolerant, and secure environment for the product. In your every-day activities, you’ll make use of open source tools, automation, and Cloud-Native solutions, tweaking, expanding and even creating new tools and flows, to empower our organisation and its engineers to better serve our customers.\nWe will pair you up with world-class talent in cloud and software engineering and provide you with a position and environment for continuous learning. \nRequirements: \nSolid knowledge of Micro-services architecture patternsStrong experience developing code in at least one high-level programming language (preferable on Go)Ample experience building highly automated infrastructuresGood understanding of modern development and operations processes and methodologiesYears of experience in Docker and containers orchestrationExperience working with Agile Methodologies(Scrum)Experience with Cloud-Native solutions for observabilityExperience in developing and releasing Helm Charts or Kustomize packagesExperience in working with immutable infrastructure and IaC principlesExperience designing, operating, and troubleshooting solutions using AWS or GCP or AzureExperience with Terraform at scale and module development/testingStrong communication skills and ability to work both in a team environment and independently.\nNice-to-haves:\nExperience with hybrid cloud infrastructure is a plusExperience with Prometheus, FluentD, Grafana, AgroCD, Linkerd.\nWhat we offer: \nPlaying a part in the story of a fast growing companyCompetitive compensation packageInteresting career opportunities and trainingVery highly skilled colleaguesTea, coffee and soft drinks at officeGym, game room, parking or public transport benefitHome internet and mobile phoneLunch and recreational benefitsOccupational health care.Office: Finland-HelsinkiRelocation package"
    ],
    "https://career.habr.com/vacancies/1000089065": [
        "Задачи: \nПроектирование и разработка серверного ПО (бэк + несложный фронт для админок для серверной игровой платформы и систем мониторинга игровых автоматов)Деплой и поддержка систем в продакшенеРеагирование на проблемы в продакшене\n\nТребуемый опыт:\nNode.js (сервер + фронт)MySQL, PostgreSQL, MongoDBGitОпыт коммерческой разработки во всем вышеперечисленном\n\nБудет плюсом:\nОпыт разработки ПО под десктопОпыт разработки ПО под LinuxОпыт администрирования Linux-системОпыт работы с AWSОпыт работы с Docker\n\nО компании:\n  Лицензированный производитель игрового оборудования в США (игровые и лотерейные автоматы и системы). Компания продуктовая, не галера, не аутсорс. Команда разработчиков распределённая."
    ],
    "https://career.habr.com/vacancies/1000089064": [
        "Описание проекта\nМы - команда, тестирующая платформу взыскания. С нашими автоматизированными системами работает более 7 тысяч сотрудников Банка. Здесь тебе будут рады, если ты готова/готова вкладываться в общее дело, развиваться и находить новые неожиданные решения.\nОбязанности:\nВ твои задачи будет входить следующий набор активностей: можно делать все и стать экспертом в направлении, а можно выбрать любимые и прокачать свои навыки в локальных задачах.\nИтак, ты сможешь выполнять:\nАнализ и подготовку профиля нагрузки для разных автоматизированных системРазработку скриптов нагрузочного тестированияНастройку и поддержку систем мониторингаАвтоматизацию активностей нагрузочного тестирования ( Привет, Devops !)Проведение тестов по оценке производительности автоматизированных системПодготовка отчета по нагрузочному тестированиюПодготовка скриптов генерации данных, как правило, это phyton+ SQL\nТребования:\nОбязательно:\n1. Знание основ тестирования ПО.\n2. Опыт работы в сфере разработки ПО от года.\n3. Уверенное владение двумя из языков: Phyton, SQL, С++\n4. Навыки работы с багтрекинговыми системами, например, jira\n5. Протоколы: rest, http, ssl\n6. Администрирование: базовые навыки администрирования серверов linux, windows\n7. Работа с Jmeter, Selenium Grid или любая другая утилита, позволяющая подать нагрузку. Умение рассказать про опыт работы.\nЖелательно: опыт работы с БД (Oracle или Postgre), системы мониторинга ресурсов серверов (любые – важно понимание принципов работы).\nДополнительно: pearl, bash, java. Знание основ ООП.\nУсловия:\nНаша команда работает в двух регионах, но это не мешает нам быстро и эффективно выполнять свои задачи. Мы работаем по kanban.\nЕсли ты понимаешь, что знаний пока не хватает, но тебе очень хочется работать в нагрузке, приходи - пообщаемся.\nТы точно многому научишься у нас!\nКрупнейший банк и работодатель РоссииАктивная и вовлеченная команда единомышленников;Комфортный офис с большой бесплатной охраняемой парковкой, столовой и спортзалом;График работы - 5/2;Стабильная заработная плата: 5 и 20 числа каждого месяца;Годовое премирование;Корпоративное обучение;Широкий круг интересных задач, возможность профессионального развития;Расширенный социальный пакет (ДМС, страхование жизни, профсоюз);Сниженные корпоративные ставки по кредитным продуктам"
    ],
    "https://career.habr.com/vacancies/1000089063": [
        "Развитие и поддержка инфраструктуры.Развитие и настройка процессов CI/CD.Поддержка работы, обновление конфигурации решений.Изучение и внедрение новых технических решений (R&D).Ведение документации.Дополнительные инструкцииОпыт с Unix системами. Знания и опыт работы с Grafana, Prometheus.Знания и опыт работы с СУБД Postgres,Redis и тд.Опыт конфигурирования Nginx, Haproxy.Желателен опыт написания bash/shell скриптов.Желателен опыт написания кода на функциональных языках.Английский язык на уровне чтения тех документации.Желателен, но не обязателен опыт с Kubernetes и Docker.Желателен, но не обязателен опыт с NixOS / GNU Guix.\n"
    ],
    "https://career.habr.com/vacancies/1000085766": [
        "Желаете присоединиться к команде одного из самых крупных сервисов удаленной работы и фриланса Freelancehunt и каждый день помогать тысячам людей находить работу? Мы ищем увлеченного фронтенд разработчика с широким кругозором, который не боится иногда заглядывать на бекенд и знает как построить современную фронт архитектуру. \nНаш стек технологий\nFrontend: Vue.js, Webpack/Babel, SASS + jQuery/Bootstrap (которые будут заменены на Tailwind/PostCSS).Backend: PHP 7.4+/8, node.js. Инструменты: Figma, Asana, Postman, Slack, Github, CircleCI, Codecov, Bugsnag.\nТребуемые навыки \nМобильная, валидная и адаптивная вёрстка.Знание современных стандартов и практик во фронтенд разработке, от CSS3/HTML5 до сборок Webpack.Уверенное знание Javascript.Опыт работы с PostCSS.Умение писать чистый, понятный и покрытый тестами код (от unit до e2e тестов).Знание PHP на уровне чтения и понимания кода будет плюсом. Опыт работы с Vue.js будет значительным плюсом.\nПримеры задач из бэклога, с которыми предстоит работать\nПолный редизайн сайта с посещаемостью около двух миллионов пользователей в месяц.Миграция Bootstrap, jQuery и SASS на Tailwind UI, PostCSS и Vue.js. Улучшение фронтенд архитектуры (структура кода, сборка, coding style, unit testing).Разработка SPA поиска по базе пользователей.Верстка и разработка фронтенд виджетов и модулей.Верстка промо-страниц по макетам в Figma.Оптимизация скорости загрузки страницы. Реализация мессенджера на Vue.js.\nЛичные качества\nУмение достигать цели вне зависимостей от препятствий, возникающих на пути;Желание работать в команде, учиться и учить новому;Честность, самостоятельность, самоорганизованность;Системное мышление, умение учитывать взаимное влияние всех компонент системы при разработке;Неутомимое стремление к автоматизации и прагматичный подход к решению задач;Умение чётко излагать мысли письменно и доносить свои идеи до коллег;Вовлеченность в продукт, который вы разрабатываете.\n\nПодробнее о нас\nМы на 100% продуктовая компания, поэтому вы сможете не только влиять на качество кода и архитектуру, но и непосредственно принимать участие в полном цикле продуктовой разработки. Вы сможете напрямую видеть, как написанный вами код помогает нашим пользователям находить работу или профессионалов для реализации своих проектов. А чтобы процесс разработки был максимально приятным, мы используем лучшие инженерные практики и платные SaaS. Мы работаем по kanban и continuous delivery, проводим code review и выпускаем новые версии несколько раз в день. \nБонусыБонусная программа — обменивайте “спасибо” от своих коллег на сертификаты интернет и оффлайн магазинов;Ежегодный бюджет на обучение и спорт;Оплачиваемый отпуск 24 дня в году;Горизонтальная команда и быстрое принятие решений;Дополнительные инструкцииКак выглядит процесс интервью?\n1. Нетехническое интервью в Google Meet 1а. Тестовое задание по результатом нашего знакомства (если у вас нет публичных репозиториев или проектов, которые вы можете показать)\n2. Техническое интервью\n3. Оффер. "
    ],
    "https://career.habr.com/vacancies/1000073689": [
        "Решение Larix позволяет обеспечить максимально точное управление стоимостью объекта. Обеспечивает автоматическое формирование ВОР и сметной документации на основе 3D-модели с помощью базы данных норм и расценок, сформированных под конкретного заказчика. Оптимизирует производство тендерных процедур путем сокращения объема документов и создания прозрачного и безопасного рабочего процесса.\nКонсультант-аналитик в компании Айбим — это специалист, который собирает знания о бизнес-процессах заказчиков, систематизирует их, формализует функциональные требования для создания технического задания на разработку программного обеспечения и далее участвует в процессе его внедрения. \nЗадачи аналитика:\n       Взаимодействие с заказчиками и экспертами предметных областей с целью сбора требований к автоматизации бизнес-процессов;        Консолидация требований заказчиков, их формализация и участие в создании наиболее универсального решения для задач по автоматизации процессов;       Проверка программного обеспечения на полноту реализации функциональных требований;       Участие в функциональном тестировании программного обеспечения;       Описание функционала программного обеспечения, подготовка пользовательской документации по программному обеспечению.\nОжидания от кандидата: \n       Высшее техническое образование, опыт работы по специальности не менее 3-х лет;        Наличие опыта в проектах по автоматизации процессов строительства или торгов является преимуществом;\n\nСтремление и желание      погружаться в функционал продукта и задачи заказчиков;\nКоммуникабельность, умение      работать в команде, ориентированность на результат.\n\nФорма сотрудничества и оплата труда:\nЗаработная плата по договоренности.\nОформление по ТК РФ, либо на договорных условия (freelance). Основная команда разработки расположена в офисном центре «Кантри Парк» расположенном на МКАД со стороны города Химки. Сотрудникам компании предоставляются бесплатные парковочные места на подземной парковке бизнес-центра и возможность воспользоваться бесплатным шаттлом для проезда от метро Планерная.\nНа текущий момент разработка ведется удаленно, однако для более качественной коммуникации и обсуждения архитектурных вопросов, необходимо иметь возможность периодического присутствия в офисе по договоренности с командой.\n\nО компании\nКомпания Айбим — поставщик IT технологий для автоматизации строительства и комплексный консалтинг в проектах цифровизации для девелоперских, промышленных и инфраструктурных компаний.\nЗа 9 лет работы с девелоперскими и строительными компаниями разных уровней цифровизации у нас сформировалась не только глубокая экспертиза в сопровождении комплексных проектов, но и собственное семейство программных продуктов Larix — решения для расчета стоимости объекта, управления контрактами и договорами.\nСегодня Айбим — часть международной группы BPS International, занимающей лидирующие позиции в сфере BIM-технологий на рынках Германии и России."
    ],
    "https://career.habr.com/vacancies/1000088488": [
        "Do you want to continue your career in our team as a JavaScript Software Engineer? Great! Be ready to work on challenging technical problems, which require the highest quality work. The team works on a flagman product with the platform that provides financial analysis data, real-time information - all in a highly customized experience on desktop, web and mobile.\nWHAT YOU’LL DO\nPlay developer role in a team of professionalsWrite high-quality code and be involved in review discussions and software solutions designPropose and discuss complex technical solutions, create design documentsMentor less experienced team membersCollaborate with other engineers within distributed teams to share ideas and produce the best possible workCommunicate with the customer, refine functional and non-functional requirementsProvide demo and sharing sessionsAnalyze and improve the performance, efficiency and stability of several applicationsCreate a unit test for projects, since code quality is the top priority for the team and customer\nWHAT YOU HAVE\n3+ programming experience in web app creation using any JS frameworks (preferably Polymer, Electron)Strong technical and problem-solving skills, analytical thinkingExperience working with a customer, conducting demo, clarifying requirementsProven ability to work both independently and with a teamGood communicational English skills, both verbal and written\nTECHNOLOGIES\nMostly Typescript, Electron FrameworkSome Angular/Polymer/React\nWE OFFER\nOutstanding career development opportunitiesKnowledge-sharing with colleagues all around the worldRegular assessments and salary reviewsCompetitive compensationSocial package – medical & family careFriendly team and enjoyable working environmentUnlimited access to learning courses (LinkedIn learning, EPAM training courses, English regular classes, Internal Library)Community of 47,500+ industry’s top professionalsFlexible working scheduleCorporate and social events"
    ],
    "https://career.habr.com/vacancies/1000089062": [
        "КРОК — ИТ-компания с комплексной экспертизой: мы делаем 2500+ проектов в год — от заказного ПО до инженерных систем зданий.\nРезультатами нашей работы пользуются миллионы людей в 42 странах мира.\nНаша команда в Челябинске обеспечивает стабильность ИТ-инфраструктуры клиента в энергетической отрасли. Мы растём и ищем нового коллегу.\n\nПриглашаем в свою команду СИСТЕМНОГО АНАЛИТИКА\n\nНАШИ ОЖИДАНИЯ\nОпыт разработки и согласования бизнес-требованийОпыт разработки и согласования Банковских фронтовых бизнес-процессовНавыки разработки тех. документации (ФТ, ТЗ, Методик тестирования и пр.)Знание основ моделирования бизнес-процессов и BPMN;Знание основ тестированияОпыт работы с технологиями интеграции систем REST, MQ, SOAP;Опыт работы с описанием API и процессов (sequence diagram, XML/XSD, JSON/JSON-Shema)\n\nВАШИ ЗАДАЧИ\nПолный жизненный цикл реализации бизнес-требований от формирования до внедрения и тиража в промышленную эксплуатацию:Сбор, анализ и формализации бизнес и функциональных требований.Разработка и согласование технических заданий;Разработка базовой архитектуры решения, согласование с IT-архитектором;Постановка задач разработчику (подрядчику);Контроль настройки и проверка тестовых сред;Контроль проведения тестирование функционала;Участие в аудите и контроле качества решения;Участие в внедрении в рамках общебанковского релиза;Участие в сопровождении решения – анализ и локализация ошибок в работе ПО/ИС.\n\nТРЕБОВАНИЯ, СПЕЦИФИЧНЫЕ ДЛЯ СТРИМА:\nПонимание архитектуры построения и обслуживания в контакт центрах;Понимание «жизненного цикла» звонка внутри контакт-центров;Понимание технологий ASR/TTS;Понимание технологий биометрии;Знание предметной области и принципов работы банковской организации (желательно);Понимание принципов обслуживания в контакт-центрах, окружение, архитектура (желательно/обязательно);\n\nМЫ ПРЕДЛАГАЕМ\nКонкурентную зарплату по результатам собеседования;График работы: 5/2 с 8:00 до 17:00 или с 9:00 до 18:00. Частично удаленная работа на период неблагоприятной эпидемиологической ситуации;Профессиональное развитие;Прокачивай свою экспертизу через участие в сложных проектах, обучение и сертификацию за счет компании.Делись знаниями и опытом — становись наставником, тренером или амбассадором бренда."
    ],
    "https://career.habr.com/vacancies/1000082506": [
        "Привет!\nProfilance Group — группа компаний и надежных онлайн-сервисов, помогающих людям освободить время на себя, свои увлечения и близких.\nПлюсы работы глазами нашей команды/Почему команде нравится работать у нас:\n1. Бирюзовые принципы управления:\n— внимательное и заботливое отношение к каждому сотруднику;\n— адекватность и взаимопонимание внутри команды;\n— ценится время сотрудников и их право на отдых;\n— самоорганизация сотрудников.\n2. Возможность работать из любого уголка страны (и не только).\n3. Свобода в организации рабочего времени.\n4. Возможность увеличить свою заработную плату при наличии крутых результатов и достижений.\n5. Экологичные проекты, делающие наш мир лучше.\n\nНемного о наших проектах:\n«Все сдал!» — современный онлайн-сервис, созданный для тех, кому требуется помощь в учебе, и тех, кто эту помощь может оказать.\n«Гульдог» — это интернет-сервис, предоставляющий услуги по выгулу, передержке собак в Москве и Санкт-Петербурге.\n«Мурчалкин» — этот интернет-сервис по передержке кошек в Москве и Санкт-Петербурге.\nОнлайн-школа «Гульдог» — школа по воспитанию и дрессировке собак.\n«Няня Рядом» — это интернет-сервис, предоставляющий услуги по присмотру за детьми.\n«Need For Skills» — платформа для тех, кто жаждет прокачать свои навыки, помогающие в работе и карьере, в легком формате игры.\n«Турбо-ассистент» — онлайн-помощник с поминутной оплатой.\n\nСейчас мы активно растем и запускаем новые сервисы. Настало время пригласить в нашу команду еще одного специалиста — Backend-разработчика!\nЧем нужно будет заниматься:\nразрабатывать и расширять API проектов по стандартам REST и GraphQL;добавлять новые / изменять существующие функции на сайте;настраивать интеграцию со сторонними сервисами или вносить изменения в существующие интеграции;подготавливать и запускать A/B тесты;интегрировать верстку блоков или страниц на сайт;настраивать показ попапов, валидацию и отправку форм;вносить изменения в существующую верстку или скрипты;анализировать сложные задачи, задавать уточняющие вопросы, делать декомпозицию задач, прогнозировать срок выполнения задач.\nЧто для нас важно:\nумение разрабатывать качественный и работающий без ошибок сайт, отвечающий требованиям и задачам бизнеса;умение работать в режиме многозадачности (нужно переключаться с одного проекта на другой);есть опыт разработки на PHP 7+ более года, а также знание SQL и опыт работы с MySQL;есть опыт работы с фреймворком Laravel 7+ (возможно с Symfony) более полугода и знание HTML, CSS, JavaScript на базовом уровне (плюсом будет знание ES6+);понимание и использование принципов ООП, MVC;умение разбираться в чужом коде;умение пользоваться системой контроля версий Git.\nПочему тебе понравится работать с нами:\nУдаленная работа из своей уютной квартиры или любого другого места, где есть доступ в Интернет.Мы плотно взаимодействуем и общаемся внутри команды. У нас есть оффлайн Книжный клуб каждые полгода в новом городе, онлайн-корпоративы, созвоны в виртуальном-кафе.Обучение и развитие за счет компании (посещение конференций, семинаров, онлайн и оффлайн обучение) уже после прохождения испытательного срока. Наши сотрудники посещают крупные всероссийские конференции: HighLoad Conf, PHP Russia, Frontend Conf, TeamLead Conf.Возможность выбирать и брать интересные задачи, переходить в новые проекты компании, карьерный рост.40-ка часовая рабочая неделя со свободным распределением рабочего времени.Официальное трудоустройство со всеми соц.гарантиями. Не подработка, не фриланс, не совмещение.Заработная плата: обсуждается индивидуально.\nМы ищем тебя, наш будущий коллега! Присоединяйся к Профиланс Групп -— это будет интересно и динамично! Отправляй отклик :)БонусыПреимущества:\nУдаленный формат работы, сотрудник сам управляет своим рабочим временем, профессиональное развитие сотрудников!"
    ],
    "https://career.habr.com/vacancies/1000087848": [
        "Банк Открытие ищет Java разработчика (Senior/Middle) в связи с расширением штата сотрудников, предлагаем дополнить команду департамента Digital,\nкоторый занимается разработкой интернет и мобильного банка.\nКратко о нас:\nОткрытие — входит в ТОП-10 крупнейших банков России (второе место в рейтинге Internet Banking Rank).  \nБанк «Открытие» стал лауреатом конкурса Проект года-2020 в номинации «Безопасность».\nРеализация в банке политики «ИТ для людей», направленной на повышение удовлетворенности и лояльности внутренних пользователей ИТ,\nкоторых насчитывается несколько тысяч. Согласно последнему внутреннему опросу более 80% сотрудников Банка «Открытие» высоко оценили качество обслуживания ИТ – на 4 и 5 по пятибалльной шкале. \nВажнейшей составляющей успеха динамической модели является способность IT-ландшафта и IT-архитектуры банка обеспечить высокую скорость разработки и вывода в промышленную эксплуатацию новых продуктов и сервисов. \nБанк «Открытие» стал победителем премии в области клиентского опыта СХ WORLD AWARDS.\nНаши офисы входят в категорию «Лучшие цифровые офисы» .\nВ Открытие 14 Core Banking Systems и процессинговых центров. Более 400 информационных систем. Единый ИТ-сервис. Команда поддержки ИТ. Стандарты SLA. Система для работы ИТ.\nВам предстоит:\n∙ Server-side разработка сложных многопользовательских систем;\n∙ Развитие и поддержка существующего многокомпонентного сервиса;\n∙ Написание новых бизнес и интеграционных компонентов сервиса;\n∙ Взаимодействие с другими членами команды разработки (аналитики, разработчики, тестировщики);\n∙ Участие в проектировании компонентов системы;\n∙ Code Review.\nМы ждем от вас:\n∙ Опыт разработки сложных интеграционных приложений;\n∙ Опыт проектирования технической архитектуры;\n∙ Опыт работы в команде;\n∙ Уверенное знание Java, в том числе Java 8,11;\n∙ Опыт разработки web-приложений от 2 лет;\n∙ Опыт работы с Spring Framework(Core, Data, MVC) от 1 года;\n∙ Опыт работы с SpringBoot, JPA, JMS, Gradle;\n∙ Знание протоколов (REST, SOAP);\n∙ Опыт работы с SQL (Postgres) и Docker;\n∙ Знание linux на уровне пользователя командной строки;\n∙ Опыт работы с системами контроля версий;\n∙ Чтение технической литературы на английском языке.БонусыМы предлагаем вам:\n∙ Стать частью крупного, развивающегося банка с внутренней атмосферой стартапа;\n∙ Работу в команде единомышленников, неравнодушных к передовым технологиям и практикам;\n∙ Неограниченные возможности для совершенствования ваших навыков и знаний, обучаясь у лучших и решая сверхамбициозные задачи;\n∙ У вас будет возможность попробовать свою бизнес идею в нашей «Фабрике Пилотов»\n∙ Позитивную рабочую обстановку в режиме Focus & Flow\n, дружный коллектив;\n∙ Достойную и конкурентную заработную плату, квартальные и годовые премии, размер которых зависит от результатов вашей работы;\n∙ Приятную рабочую атмосферу: современный офис возле метро “Динамо”;\n∙ Разнообразный социальный пакет: ДМС, страхование жизни, страхование для выезжающих за границу, льготные условия приобретения банковских продуктов, скидки в фитнес-клубах и в компаниях-партнерах."
    ],
    "https://career.habr.com/vacancies/1000060462": [
        "SKILLS\nAdvanced knowledge of software development and architecture.\nAt least 10+ years of software development.\nDeep knowledge and understanding:\nnetworking and protocolssoftware architecturetesting methodologiessecure application principlesprinciples of clean and maintainable codedocumentation-first approachstrong team player and robust communication skillsfluent spoken English is mustunderstanding base Agile methodologiesyou must eat a peck of salt in your previous projects\nRESPONSIBILITIES\nWe are creating a complex app with the following stack:\nAWSgo servicesa little amount of JS servicesAI core with PythonKafkaMongoDBRedis\nIntegrating with 3rd party hardware, like Tesla, Alpha, General Electric and sometimes creating our own pieces of hardware.БонусыYou have a chance to be part of an outstanding international team to create the powering financial services for banks, groups or brands to enable effective and personalize customer engagement.\nGetswif.com is an IT-start-up in partnership with a big UAE Bank. With the Swif Al and Machine Learning Engine, experiences can be tailored to users based on their personal banking, card transactions, unique customer information, and much more. Suggesting the right offers, and delivering the ideal experiences, at the right time, to the right customers.\nWe are using the most recent tech stack and always are open for R&D and future tech adoption. Do not waste your talent working with dying tech for useless projects. Your life and talent are priceless, use it wisely.\nIt is not outsourcing/out-staffing. We are one big happy team.\nSome additional goodies included:\nYou can work remotely or at our offices, fully equipped and located in Kremenchuk, Sydney, or Tel-Aviv.\nWe provide a laptop and all necessary equipment (iPhone, iPad, Android devices, etc ...) to our developers.Working hours are flexible, like completely flexible. You can work as much as you wish and whenever you want. The only requirements is to participate in planned meetings.You get free English lessons with a qualified IT English teacher and native speaker.We compensate 70% of the cost of the subscription to the gym (or another type of sports activity).We compensate 30% if you decided to buy your personal equipment for work. It’s not required though. By default, we will provide you with everything you need.The webinars, courses, and conferences for your professional development are fully compensated.24 paid holidays a yearCookies, fruit, coffee, tea, and a lot of milk are available every day!The fantastic team of professionals, that will make your work enjoyable and your work valuableДополнительные инструкцииOther languages like NodeJS, RoR, C#, and Java. Any backend experience is appreciated (even Perl and Erlang :-))\nFrontend development is a plus (ReactJS, Vue, Angular) (not all of them, at least one is already a big plus)\nDocker and K8s.\nAWS certification/experience is a big plus\nAPI testing, integration testing\nPerformance and stress testing\nOpen-source contribution"
    ],
    "https://career.habr.com/vacancies/1000088487": [
        "Geecko - cервис для развития HR-бренда IT-компаний и рекрутинга IT-специалистов через маркетинговые инструменты. Система Geecko состоит из нескольких сервисов: Geecko Skills для автоматизированной оценки навыков соискателей, Geecko ID и Geecko ADS для сбора вашей лояльной аудитории и работы с ней, Geecko Marketplace HR-активностей. Решение по привлечению и удержанию программистов работает через игровые механики, которые дают компаниям возможность снизить стоимость привлечения кандидатов.\nМы вышли на американский рынок и возросла необходимость расширить штат. Рассматриваем кандидатов как на Россию, так и на США.\n\nЧто предстоит:\n\nКоммуникации с сотрудниками компании и стейкхолдерами, приоритизация, предоставление текущих статусов, качественная обратная связь;\nСоздание и ведение общего плана разработок кросс-команд, контроль оценок;\nСопоставление релизных планов;\nУправление рисками;\nУправление и развитие кросс-команд;\nИнициация и организация проведения совещаний и их планирование по ходу выполнения проекта, подготовка необходимых для совещания материалов, протоколирование и контроль исполнения по решениям (по мере необходимости);\nДокументирование работ по проекту в Notion, ведение списков задач по проекту в Linear;\nСвоевременная передача задач в команду маркетинга;\nПрезентация результатов проекта заказчику.\n\n\n\nЧто ожидаем:\n\nОпыт управления командами разработки от 2 лет;\nОпыт управления проектами по заказной разработке и сопровождению;\nУмение планировать задачи и расставлять приоритеты по ним;\nУмение принимать важные решения и нести ответственность за эти решения;\nЖелание и стремление помогать клиентам, получать выгоду от работы и дополнительные бонусы;\nУмение формировать технические требования на основе нечетких требований;\nГотовность постоянно разбираться в новых технологиях, развиваться и извлекать пользу из приобретенного опыта;\nОпыт в роли владельца продукта или аналитика будет плюсом;\nГрамотная устная и письменная речь;\nДополнительный плюс - владение английским на разговорном уровне.\n\n\nМы используем: \nSlack, Notion, Linear, Figma, Zoom, Loom, Miro\n\nЧто предлагаем:\n\nГрафик работы 5/2\nВозможность работать из любого города\nРабота в стартапе с большой возможностью влиять на продукт\nПрозрачная система профессионального и зарплатного роста\nДружелюбная атмосфера, демократичное руководство и отсутствие излишней бюрократии\n\n\n"
    ],
    "https://career.habr.com/vacancies/1000089061": [
        "Ключевая цель команды на ближайший год: обеспечить выполнение смарт-контракта на заказную разработку платформы по управлению активами в рамках заказчика основываясь на теории solid-технологий для реального сектора (B2B) российского рынка.\nОжидаемый результат от бизнес-аналитика:\n       Разработать описание к интеграционному взаимодействию разрабатываемого решения в соответствии с моделью данных проектов шаблонов и  информационного окружения;       Подготовить описание требований к инфраструктуре размещения и безопасного хранения;       Определить перечень демонстрируемых функций прототипа в соответствии с результатами обследования.       Разработка презентаций для представления результатов Пилота руководству заказчика.\nОписание роли бизнес-аналитика:\n       Анализирует   бизнес-процессы   заказчика   и определяет, как наиболее оптимально встроить в них продукт.       Проводит   реинжиниринг   бизнес-процессов заказчика   в   связи   с   переходом   на активоцентричный подход в управлении.        Определяет   какие   данные   являются «значимыми» для их публикации на разрабатываемом решении.       Определяет векторы интеграции и формирует бизнес-требования   к   интеграции   систем   (на уровне бизнес-процессов).        Проводит   анализ   рынка   и   потенциальных заказчиков   на   предмет   определения   бизнес- кейсов   и   построения   гипотез   применения\nпродукта.        Выполняет Cust Dev – проводит исследования\\ интервью   для   выявления   потребительских свойств   продукта   и   дает   предложения   по внесению их в продукт.        Разработка   документов   (концепций,   ТЗ, презентаций продукта) \n\n\nОжидаемые результаты деятельности бизнес-аналитика в проекте:\n\nСбор требований для формирования моделей данных  по хранению информации об активах      заказчика (корпоративные системы, подрядчики и т.д.), применительно к      использованию в разрабатываемом решении\nРазработка требования к системе в части структуры данных, интеграции      данных, инструментов по автоматизации и подготовки данных.\n\nРекомендации к опыту:\n       Опыт в разработке стратегий автоматизации\\ит\\цифровизации, бизнес и продуктовых стратегий для крупных корпоративных заказчиков уровня РЖД, Газпром и т.д.       Внедрение систем ITIL\\ITSM будет + (отсутствие опыта не является стоп-фактором)       Релевантный опыт с командой заказчиками по сбору требований к бизнес-процессам, применительно к работе с активами.       Подтверждаемый опыт разработки требований к разрабатываемому ПО, написание концепций, ТЗ, разработка презентаций       Анализ рынка, разработка бизнес-кейсов и гипотез, Cust Dev       Опыт работы в консалтинге и системном интеграторе со стороны  команды внедрения.\nУсловия работы:\n\nМы стараемся поддерживать высокую скорость работы и принятия решений в      команде.\nМы полностью соблюдаем ТК РФ.\nСтараемся вести открытую\\гибкую кадровую политику\nНаходимся в шаговой (действительно шаговой) доступности от м. улица      1905 г.\nРассматриваем разные варианты занятности\nГибкие условия по графику работы(удаленная\\офис).\nЗаработная плата высокая \n Местные командировки (офисы заказчиков г. Москва (ЦАО). \n\nТехнологические стеки, которые будут применены или  планируются применяться в проекте:\n1. Semantic Web\n2. Linked Data\n3. RDF\n4. OWL\n5. SPARQL\n6. SOLID"
    ],
    "https://career.habr.com/vacancies/1000088486": [
        "Открыт набор на вакансию Frontend разработчика со знанием Vue.js.\nВАШИ ЗАДАЧИ:\nПервым проектом будет замена крупной системы документа оборота на основе Documentum на нашу собственную современную разработку;Быть активным членом крутой и опытной команды, которая уже много лет занимается этой предметной областью и знает, как сделать правильно;Участвовать в выработке технологических решений.\nНАШИ ОЖИДАНИЯ:\nУверенное владение языком JavaScript;Разбираться во фреймворке Vue.js и делать на нем промышленные проекты.\nДОПОЛНИТЕЛЬНО ПРИВЕТСТВУЕТСЯ:\nЗнание TypeScript;Понимание объектно-ориентированного программирования.\nМЫ ПРЕДЛАГАЕМ:\nДостойную зарплату. На собеседовании мы детальнее познакомимся с тобой, твоими навыками, и открыто обсудим вопрос зарплаты с премиальной частью.Максимальный комфорт. Тебя ждет удобное рабочее место с мощным железом, современный офис, бесплатные обеды и перекусы, чай/кофе, большая парковка.Отличную команду, в которой ценят вклад каждогоПрофессиональное развитие. Мы поддерживаем стремление к развитию, обучая и сертифицируя членов команды. Также можно хорошо подтянуть английский язык — мы компенсируем занятия.Заботу о здоровье. ДМС с полным пакетом медицинских услуг, оборудованный фитнес-зал прямо в офисе, более 10 спортивных программ: от футбола до тенниса.По договоренности можно работать полностью удаленно."
    ],
    "https://career.habr.com/vacancies/1000088485": [
        "Мы ищем именно тебя, если твой профиль соответствует этим требованиям:\nОпыт разработки на Python: Django, Django Rest Framework, Django Channels;Работа с PostgreSQL, Docker, Celery, Redis, Kafka/RabbitMQ;Опыт работы с Git (по Git Flow в команде);Высшее техническое образование;Креативный подход к решению бизнес-задач, готовность использовать новые инструменты, методы и лучшие практики.\nТвои конкурентные преимущества:\nОпыт разработки на Python: Flask, FastAPI;Опыт использования CMS Wagtail и CMS Django;Менторство младших специалистов, проведение code review;Навык написания unit тестов;Использование Agile и Jira в реализации проектов;Взаимодействие со смежными командами: аналитиками, дизайнерами и тестерами;Имеешь широкое представление в области применения цифровых технологий, в том числе в отдельных отраслях.\nМы гордимся проектами, которые реализуем:\nПомогаем одному из крупнейших российских банков развивать цифровую экосистему и запускать новые продукты;Создаем цифровую платформу «под ключ» для реализации одного из национальных проектов - от концепции до запуска и технической поддержки;Внедряем персональные носимые устройства и мобильные приложения для решения производственных задач – защищенные корпоративные мессенджеры, таск-менеджеры, чат-боты и роботы помогают переводить бизнес-процессы в мобильный формат;Сокращаем сроки создания и выпуска продуктов в разы за счет применения гибких методов, итеративной разработки.\nМы предлагаем:\nЗаработная плата по результатам собеседования + премии по итогам работы;Профессиональное обучение и сертификация за счёт компании;ДМС с полным пакетом медицинских услуг;Изучение английского языка в очном и дистанционном форматах с компенсацией от компании;Абонемент в фитнес-центры и спортивные программы с компенсацией от компании, тренажёрный зал в офисе;Бесплатное питание в офисе;Современный офис, парковка для всех сотрудников."
    ],
    "https://career.habr.com/vacancies/1000087310": [
        "Компания CUSTIS специализируется на проектировании, разработке и развитии масштабных информационных систем. На протяжении 25 лет мы реализуем сложные проекты по трансформации бизнеса наших клиентов – лидеров отраслей, используя инновационные подходы к проектированию и современные технологические платформы.\nДля одной из крупнейших розничных торговых сетей наша команда создала набор решений, который охватывает значительную часть ИТ-ландшафта клиента. Уже более 10 лет мы продолжаем успешное развитие каждой ИТ-системы, обеспечивающей функционирование основных процессов ритейлера, связанных с учетом и перемещением товаров. Наши системы позволяют осуществлять управление товарным запасом в более чем 1500 магазинов, обеспечивают товародвижение и документооборот на территории РФ и в других странах присутствия для всех каналов реализации товара.\nДиспетчеризация - это информационная система управления внутренним товаропотоком, обеспечивающая круглосуточную координацию процессов отгрузки товаров со складов и управление логистикой их доставки как во внутренние подразделения, так и внешним клиентам ритейлера. Диспетчеризация взаимодействует с другими информационными системами (системами управления складом, билинговыми и SCM-системами, системами претензионной работы), позволяя нашему клиенту осуществлять оперативный обмен данными при управлении отгрузкой.\nПожелания к кандидатам:\nумение и готовность общаться с аналитиками, специалистами по внедрению и сопровождению со стороны заказчика;активная и ответственная позиция по работе с системой;внимательность и аккуратность, готовность работать в команде;опыт работы системным аналитиком;опыт написания функциональных и технических требований к разрабатываемой системе, согласования документации с заказчиками и разработчиками;опыт тестирования, внедрения и сопровождения ИТ-системы;опыт работы совместно с младшими аналитиками и наставничества;написание SQL-запросов;владение средствами и нотациями визуального моделирования (UML, BPMN);аналитический склад ума, системное мышление, умение собирать, структурировать и четко излагать информацию;хорошие коммуникативные навыки;\nСодержание работы:\nуправление требованиями и взаимодействие с заказчиком на всех этапах жизненного цикла проекта:сбор, уточнение, анализ и описание поступающих требований от заказчика;создание спецификаций на реализацию необходимого функционала;проектирование тестовых сценариев;внешнее и внутреннее согласование документации;функциональное тестирование системы (верификация функционала на соответствие постановке);обновление документации по итогам разработки;участие в демонстрациях продукта (системы) клиенту;участие в сопровождении программного продукта, фиксация и анализ замечаний на доработку;консультация внутренних разработчиков, а также специалистов заказчика по особенностям поведения и работы системы;погружение в предметную областьБонусыМы предлагаем:\nГибкость и комфорт\nВозможность совмещать удаленный и офисный формат работы (можно работатьполностью удаленно!), а также индивидуально планировать свой график;ДМС с возможностью выбора дополнительных услуг100% оплату больничных\nПрофессиональное развитие\nуникальные проекты и амбициозные задачикоманда настоящих профессионаловвозможности для роста и развитиясовременные технологии\nСтабильность\nкомпания с 25-летней историейпостоянные клиенты и партнёрыдлительные и масштабные проекты\nУдобное расположение\nофис в центре Москвы с комфортными рабочими местами и современным оборудованием (5 минут пешком от ст.м. Белорусская кольцевая или ст.м. Менделеевская)."
    ],
    "https://career.habr.com/vacancies/1000085841": [
        "Наша команда выросла за прошлый год и продолжает активно расти. Сейчас мы ищем ручного тестировщика c опытом автоматизированного тестирования на C# или с большим желанием развиваться в данную сторону.Обязанности:\nРазработка тестовой документации,Ручное функциональное тестирование desktop-приложения,Выявление \"узких\" мест производительности приложения,Документирование результатов тестирования.\nПожелания к кандидату:\n\nОпыт ручного тестирования ПО,\nУмение разрабатывать чек-листы и тест-кейсы,\nОпыт работы с трекерами (MS TFS, Atlassian Jira или с другими).\n\nМы предлагаем:\nГибкий график, демократия в отношениях и принятии решений,Оформление согласно ТК РФ, полностью “белая” заработная плата,ДМС, программа корпоративных скидок,Релокация в Португалию (при желании)Удаленная работа."
    ],
    "https://career.habr.com/vacancies/1000089060": [
        "Обязанности:\nКоманда разработки платформы приложений ищет сильного frontend разработчика для работы над собственным инновационным продуктом, использующимся как в Леруа Мерлен, так и за его пределами.Мы разрабатываем инновационную Low-Code платформу для построения и управления микросервисами, API и интеграционным потоками. Платформа включает в себя графические интерфейсы конфигурирования логики Drag&Drop, модули исполнения логики, системы мониторинга и real-time обработки аномалий и алертинга, управления развертыванием, Service Mesh.Технологический стек:- React, Redux, SVG, NodeJS, Socket.io.Чем предстоит заниматься:- Создавать собственный графический интерфейс для дизайнера микросервисов Low-Code платформы,- Тесная работа с владельцем продукта и дизайнером при выборе лучших графических решений,- Интеграция с back-end сервисами и интеграционными решениями компании.\nТребования:\n Уверенное знание React,- Уверенные знания Javascript / ES6,- Уверенные знания git и подходов непрерывной интеграции CI/CD,- Открытость новому, умение мыслить нестандартно,- Английский язык на уровне письменной коммуникации.Будет преимуществом:- Опыт работы с Vue,- Знания Node.js и общие навыки backend разработки,- Умение верстать красиво и доступно для пользователя,- Опыт работы с автотестами.\nУсловия:\nМы предлагаем:Отлично выстроенные командные процессы, позволяющие комфортно работать распределено.Неограниченные возможности роста и развития.Белую ЗП и расширенный социальный пакет.Развитую систему премирования.ДМС, компенсацию питания и мобильной связи + смартфон.Обучение английскому языку.Работаем на удаленке. Можно приходить в любое время в офис, рядом с м. Шаболовская, а в следующем году запланирован переезд на ст.м. ЗИЛ."
    ],
    "https://career.habr.com/vacancies/1000073612": [
        "Команда QA МТС обеспечивает качество продуктов собственной разработки, которые решают операционные и бизнес-задачи в телекоммуникационном секторе.\nВ МТС Вы найдёте проект на любой вкус!\n\nПрисоединившись к нам, в Ваши обязанности будет входить:\nручное функциональное тестирование;регрессионное тестирование;написание тест-кейсов, чек-листов, баг-репортов;отслеживание наличия исправлений по ошибкам.\nКандидаты без опыта работы не рассматриваются.\nОт вас мы ждем:\nвысшее техническое образование;стаж в тестировании от 1 года и более;опыт проведения тест-анализа на основании проектной документации;знание основных технологий и методологий тестирования;практический опыт применений методов тест-дизайна;знание языка SQL на уровне написания запросов средней сложности.\nБудет плюсом:\nпонимание стандартов качества ПО;опыт наставничества, обучения;уверенное знание теории тестирования;базовые навыки администрирования операционных систем;мотивация учиться, склонность к самообучению.\nКакие инструменты вам предстоит использовать в работе?\nTFS, JIRA, PL/SQL Developer, HeidiSQL, SoapUI, WebServiceStudio, Postman, LoadRunner, Selenium, CodedUI, Jenkins, Teamcity, MS Visual Studio, intellij IDEA, MS Test Manager.\nНужно ли знать иностранные языки?\nЗнание английского языка на уровне чтения тех. документации, будет Вашим преимуществом.\nКакие условия?\nстабильная белая заработная плата, премии;возможен полностью дистанционный формат работы;саморазвитие - мы сделали обучение доступным. Вы можете проходить тренинги очно, дистанционно, в Корпоративном университете, у провайдеров, у наставников;чемпионат по программированию – соревнуемся не только в спорте;здоровье своих сотрудников - ДМС со стоматологией, страхование жизни, страхование при поездках за рубеж;спорт - корпоративные соревнования по футболу, баскетболу и волейболу, различные спорт-программы или компенсация вашего фитнес - абонемента;хороший отдых - отпуск 28 календарных дней + 3 календарных дня дополнительно ежегодно, а также различные скидки на путешествия от наших партнеров;возможности раскрыть талант - мы поддерживаем хобби сотрудников, у нас есть корпоративный театр и кукольный театр;социальную ответственность - мы помогаем детям из детских домов, обучаем пенсионеров безопасному поведению в сети, сдаем кровь, очищаем парки от мусора на волонтерских субботниках и многое другое."
    ],
    "https://career.habr.com/vacancies/1000089058": [
        "В команду Блока по информационным технологиям мы ищем Java-разработчика.\nНаша команда занимается разработкой портала, качественно нового инструмента для работы компании с партнерами. Портал глубоко интегрирован с другими АС в ландшафте компании и является важнейшей частью Экосистемы партнерств.\n\nОбязанности:\nразработка модулей (микросервисов) интеграционной платформы предприятия в среде Java 8, Spring;проведение рефакторинга существующего кода и архитектуры;следование стандартам разработки принятым в команде, участие в их развитии;взаимодействие с аналитиками, архитекторами и тестированием в процессе проектирования и реализации задач;разработка и сопровождение ИТ-решений в интересах различных бизнес-подразделений компании;разработка по методологии Agile;поддержка разработанных приложений, участие в устранении инцидентов возникших при эксплуатации;участие в процессах анализа, разработки и внедрения нового функционала;ведение базы знаний по своему направлению;контроль исполнения и верификация результата реализации;обеспечение приемо-сдаточных испытаний (ПСИ) заказчику;разбор и устранение замечаний по результату ПСИ;разработка и согласование архитектуры и частных технических заданий;разработка эксплуатационной документации.\n\nМы ищем кандидата с:\nопытом промышленной разработки на Java 8, Spring;опытом работы с реляционными СУБД (в частности PostgreSQL);знанием ООП, WebServices, REST, Spring, JPA, Hibernate;опытом использования и конфигурации плагинов Maven;опытом использования и конфигурации системы контроля версий Git;знанием жизненного цикла программных продуктов;знанием основных протоколов интеграции ИТ приложений;знанием принципов разработки по гибкой методологии;опытом построения систем высокой доступности;опытом разработки веб-сервисов;опытом работы с системами планирования задач и учета рабочего времени.\n\nЧто мы предлагаем:\nСтабильная, белая заработная плата два раза в месяц + полугодовые премии.Расширенный социальный пакет (ДМС со стоматологией, страхование жизни, страхование при поездках за рубеж, корпоративная сотовая связь с безлимитным интернетом и многое другое).Льготные программы кредитования, ДМС для родственников, скидки на сервисы МТС для себя и друзейКомфортабельный офис в центре города с кофе, снэками и фруктамиВозможность работать вне офисаВозможность командировок по РФ и ближнему зарубежью."
    ],
    "https://career.habr.com/vacancies/1000088482": [
        "В обязанности будет входить:\nобеспечение аутстаффинга специалистов в крупнейшие компании заказчиков. KPI на результат – количество выведенных специалистов к Заказчику;ведение реестра кандидатов (как штатных сотрудников, так и подрядчиков), ежедневный контроль статуса работы по кандидату, поиск способов ускорения процессов работы с кандидатами. От скорости напрямую зависит результат;работа с подрядчиками: актуализация реестра открытых вакансий, публикация вакансий на электронной площадке, получение резюме от подрядчиков. Налаживание взаимоотношений с подрядчиками/партнерами и расширение базы подрядчиков;работа с заказчиками: сбор информации об открытых вакансиях, направление резюме специалистов на рассмотрение, получение обратной связи, организация собеседований, участие в собеседованиях;работа с техническими руководителями внутри компании: отправка резюме на рассмотрение, контроль оценки резюме, проведения собеседований техническими руководителями.\nПри успешном выполнении поставленных задач - рост и расширение зон ответственности.\nТребования:\nнацеленность на результат;инициативность, проактивная позиция;системное мышление;высокая степень самоорганизованности, умение планировать и выполнять план на день;высокий уровень ответственности и самостоятельности в выполнении задач;умение работать с возражениями, «продавать», убеждать людей принять выгодную нам позицию;грамотная устная и письменная речь;коммуникабельность (готовность делать 10+ звонков и писать 30+ писем в день);умение и готовность подстраиваться в общении с людьми, находить общий язык;высшее образование или 4-5 курс университета при готовности работать 8 часов в день;продвинутый пользователь ПК (Excel, Word, Outlook)\nУсловия:\nудаленная работа;проектная занятость;достойная зарплата с премиальной частью;при достижении высоких результатов мы поощряем стремление к росту и предоставляем большие возможности для профессионального развития и роста."
    ],
    "https://career.habr.com/vacancies/1000080821": [
        "В команду разработки платформы iOS (приложения iOS и tvOS) ищем руководителя группы тестирования. Нам нужен человек, который может мыслить стратегически, видеть цели и пути их достижения в области контроля и обеспечения качества. Но при этом он не должен бояться «испачкать рубашку», иными словами, нужен играющий тренер, который при необходимости будет готов окунуться во во все тяжкие со своей командой, чтобы выполнить задачу успешно. Если Вы проактивны, имеете опыт в тестировании и хотите расти вместе с нами, то, возможно, нам по пути!\nТребования к опыту:\nОпыт в тестировании от 2х лет;\nОпыт в тестировании мобильных приложений;\nНавыки тест-дизайна и составления тест-планов.\nПлюсами будут:\nОпыт работы с экосистемой Apple;\nОпыт написания UI-автотестов. Мы используем нативный стек: Swift + XCUITest;\nОпыт работы с языками программирования Python, Ruby. На этих языках мы пишем вспомогательные инструменты для тестирования;\nПонимание принципов работы CI/CD. Наша команда использует gitlab и Jenkins.\nЛичностные требования:\nЛидерские качества, умение вести за собой;\nНавыки планирования и стратегического мышления;\nИнициативность и желание менять мир к лучшему;\nСпособность добывать недостающую для тестирования информацию;\nУмение работать в команде, аккуратность и честность.\nОбязанности:\nУправление группой тестирования (7 человек: 2 автоматизатора и 5 функциональных тестировщиков) в команде разработки iOS (6 разработчиков);\nОбучение, планирование развития и работа с мотивацией членов команды;\nВнедрение локальных процедур, техник, регламентов в области QA;\nАктивное участие во внедрении глобальных процедур, техник и регламентов в области QA;\nКооперация с руководителями групп тестирования других направлений;\nТестирование нового и существующего функционала приложений iOS и tvOS;\nПланирование тестирования, постановка и распределение задач;\nКонтроль результатов ручного и автоматизированного тестирования;\nРазвитие автоматизации процессов тестирования.\nМы предлагаем:\nВозможность получить уникальный опыт в онлайн-кинотеатре №1 в России и СНГ;\nРазвитую культура лидерства - мы всегда рады обсудить и реализовать классные идеи;\nКонкурентная заработная плата по результатам собеседования, трудоустройство по ТК РФ;\nОфис в шаговой доступности от станций метро Дмитровская, Савеловская;\nГибкое начало рабочего дня: мы начинаем до 11 часов;\nДМС со стоматологией после прохождения испытательного срока + страховка для выезда за рубеж;\nОбучение и митапы внутри компании, а также профессиональные курсы, тренинги и участие в конференциях;\nПодписку на ivi;\nПакет релокации.\nЕще немного о нас:\nМы работаем в современном комфортном офисе, где есть зона отдыха, пинг-понг, настольный футбол и даже свой кинотеатр;\nВ ivi можно найти друзей по интересам - у нас работают музыканты, спортсмены, игроманы, киноманы и т.д.;\nМы проводим крутые корпоративы и не только: мы часто собираемся, чтобы отметить важные для нас даты или просто хорошо провести свободное время."
    ]
}